using System;

namespace Проект_на_тему_космос___it
{
    class AllDataAboutPlanets
    {
        public AllDataAboutPlanets() { }
        public string urlallplanets { get; set; } = "https://www.youtube.com/embed/kTzQ2q9SwlQ";
        public string urlearth { get; set; } = "https://www.youtube.com/embed/xOMfvlDtN5g";
        public string urlsun { get; set; } = "https://www.youtube.com/embed/hCHwcnYVGhg";
        public string urlmercury { get; set; } = "https://www.youtube.com/embed/TJT4Lr4XpcE";
        public string urlvenus { get; set; } = "https://www.youtube.com/embed/CQeqlSGqlQE";
        public string urlmars { get; set; } = "https://www.youtube.com/embed/ei0LBJSnwEM";
        public string urljupiter { get; set; } = "https://www.youtube.com/embed/EEBrwDz5Kgo";
        public string urlsaturn { get; set; } = "https://www.youtube.com/embed/NaiLLgP4tbE";
        public string urluranus { get; set; } = "https://www.youtube.com/embed/Yz4LwQIBRpg";
        public string urlneptune { get; set; } = "https://www.youtube.com/embed/8TKTwkXD2Y4";

        public string nameallplanets { get; set; } = "Со́лнечная систе́ма — планетная система, включающая в себя центральную звезду Солнце и все естественные космические объекты на гелиоцентрических орбитах. Она сформировалась путём гравитационного сжатия газопылевого облака примерно 4,57 млрд лет назад.";
        public string nameearth { get; set; } = "Земля́ — третья по удалённости от Солнца планета Солнечной системы. Самая плотная, пятая по диаметру и массе среди всех планет Солнечной системы и крупнейшая среди планет земной группы, в которую входят также Меркурий, Венера и Марс. Единственное известное человеку в настоящее время тело во Вселенной, населённое живыми организмами.";
        public string namesun { get; set; } = "Со́лнце — одна из звёзд нашей Галактики (Млечный Путь) и единственная звезда Солнечной системы. Вокруг Солнца обращаются другие объекты этой системы: планеты и их спутники, карликовые планеты и их спутники, астероиды, метеороиды, кометы и космическая пыль.";
        public string namemercury { get; set; } = "Мерку́рий — наименьшая планета Солнечной системы и самая близкая к Солнцу. Названа в честь древнеримского бога торговли — быстрого Меркурия, поскольку она движется по небу быстрее других планет. Её период обращения вокруг Солнца составляет всего 87,97 земных суток — самый короткий среди всех планет Солнечной системы.";
        public string namevenus { get; set; } = "Вене́ра — вторая по удалённости от Солнца и шестая по размеру планета Солнечной системы, наряду с Меркурием, Землёй и Марсом принадлежащая к семейству планет земной группы. Названа в честь древнеримской богини любви Венеры[7]. По ряду характеристик — например, по массе и размерам — Венера считается «сестрой» Земли[8]. Венерианский год составляет 224,7 земных суток. Она имеет самый длинный период вращения вокруг своей оси (около 243 земных суток, в среднем 243,0212 ± 0,00006 сут[9]) среди всех планет Солнечной системы и вращается в направлении, противоположном направлению вращения большинства планет.  ";
        public string namejupiter { get; set; } = "Юпи́тер — крупнейшая планета Солнечной системы, пятая по удалённости от Солнца. Наряду с Сатурном Юпитер классифицируется как газовый гигант.Перейти к разделу «#Юпитер среди планет Солнечной системы»\r\n\r\nПланета была известна людям с глубокой древности, что нашло своё отражение в мифологии и религиозных верованиях различных культур: месопотамской, вавилонской, греческой и других. Современное название Юпитера происходит от имени древнеримского верховного бога-громовержца.Перейти к разделу «#Название и история изучения»";
        public string namesaturn { get; set; } = "Сату́рн — шестая планета по удалённости от Солнца и вторая по размерам планета в Солнечной системе после Юпитера. Сатурн классифицируется как газовая планета-гигант. Сатурн назван в честь римского бога земледелия.Перейти к разделу «#Сатурн в культуре» Символ Сатурна — ♄.";
        public string nameuranus { get; set; } = "Ура́н — планета Солнечной системы, седьмая по удалённости от Солнца, третья по диаметру и четвёртая по массе. Была открыта в 1781 году английским астрономом Уильямом Гершелем и названа в честь греческого бога неба Урана.";
        public string nameneptune { get; set; } = "Непту́н — восьмая и самая дальняя от Солнца планета Солнечной системы. Его масса превышает массу Земли в 17,2 раза и является третьей среди планет Солнечной системы, а по экваториальному диаметру Нептун занимает четвёртое место, превосходя Землю в 3,9 раза[10]. Планета названа в честь Нептуна — римского бога морей[11].";
        public string namemars { get; set; } = "Марс — четвёртая по удалённости от Солнца и седьмая по размеру планета Солнечной системы; масса планеты составляет 10,7 % массы Земли.Перейти к разделу «#Основные сведения» Названа в честь Марса — древнеримского бога войны, соответствующего древнегреческому Аресу.Перейти к разделу «#В античной мифологии» Также Марс называют красной планетой из-за красноватого оттенка поверхности, придаваемого ей минералом маггемитом — γ-оксидом железа(III).Перейти к разделу «#Грунт»";
    }
}
